src/Documents/РегистрацияПропусковЗанятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>РегистрацияПропусковЗанятий</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КоличествоПосещений</xr:Item>
				<xr:Item>InformationRegister.УчетПосещений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Comment>Начало месяца проведения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дисциплина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Дисциплины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокПосещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Студент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День1</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День2</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День3</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День4</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День5</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День6</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День7</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День8</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День9</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День10</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День11</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День12</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День13</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День14</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День15</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День16</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День17</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День18</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День19</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День20</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День21</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День22</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День23</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День24</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День25</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День26</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День27</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День28</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День29</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День30</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День31</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныПропусков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолНеуваж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолУваж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолБолел</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолОпоздал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/КоличествоПосещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>КоличествоПосещений</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КолНеуваж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КолУваж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КолБолел</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КолОпоздал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/РегистрацияПропусковЗанятий/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр УчетПосещений
	Движения.УчетПосещений.Записывать = Истина;
	Для Каждого ТекСтрокаСписокПосещения Из СписокПосещения Цикл
		Движение = Движения.УчетПосещений.Добавить();
		Движение.Период = ПериодРегистрации;
		Движение.Студент = ТекСтрокаСписокПосещения.Студент;
		Движение.Дисциплина = Дисциплина;
		Движение.УчебнаяГруппа = УчебнаяГруппа;
		Движение.Преподаватель = Преподаватель;
		Движение.День1 = ТекСтрокаСписокПосещения.День1;
		Движение.День2 = ТекСтрокаСписокПосещения.День2;
		Движение.День3 = ТекСтрокаСписокПосещения.День3;
		Движение.День4 = ТекСтрокаСписокПосещения.День4;
		Движение.День5 = ТекСтрокаСписокПосещения.День5;
		Движение.День6 = ТекСтрокаСписокПосещения.День6;
		Движение.День7 = ТекСтрокаСписокПосещения.День7;
		Движение.День8 = ТекСтрокаСписокПосещения.День8;
		Движение.День9 = ТекСтрокаСписокПосещения.День9;
		Движение.День10 = ТекСтрокаСписокПосещения.День10;
		Движение.День11 = ТекСтрокаСписокПосещения.День11;
		Движение.День12 = ТекСтрокаСписокПосещения.День12;
		Движение.День13 = ТекСтрокаСписокПосещения.День13;
		Движение.День14 = ТекСтрокаСписокПосещения.День14;
		Движение.День15 = ТекСтрокаСписокПосещения.День15;
		Движение.День16 = ТекСтрокаСписокПосещения.День16;
		Движение.День17 = ТекСтрокаСписокПосещения.День17;
		Движение.День18 = ТекСтрокаСписокПосещения.День18;
		Движение.День19 = ТекСтрокаСписокПосещения.День19;
		Движение.День20 = ТекСтрокаСписокПосещения.День20;
		Движение.День21 = ТекСтрокаСписокПосещения.День21;
		Движение.День22 = ТекСтрокаСписокПосещения.День22;
		Движение.День23 = ТекСтрокаСписокПосещения.День23;
		Движение.День24 = ТекСтрокаСписокПосещения.День24;
		Движение.День25 = ТекСтрокаСписокПосещения.День25;
		Движение.День26 = ТекСтрокаСписокПосещения.День26;
		Движение.День27 = ТекСтрокаСписокПосещения.День27;
		Движение.День28 = ТекСтрокаСписокПосещения.День28;
		Движение.День29 = ТекСтрокаСписокПосещения.День29;
		Движение.День30 = ТекСтрокаСписокПосещения.День30;
		Движение.День31 = ТекСтрокаСписокПосещения.День31;
		Движение.Причина = ТекСтрокаСписокПосещения.Причина;
		Движение.КолНеуваж = ТекСтрокаСписокПосещения.КолНеуваж;
		Движение.КолУваж = ТекСтрокаСписокПосещения.КолУваж;
		Движение.КолБолел = ТекСтрокаСписокПосещения.КолБолел;
		Движение.КолОпоздал = ТекСтрокаСписокПосещения.КолОпоздал;
	КонецЦикла;

	// регистр КоличествоПосещений Приход
	Движения.КоличествоПосещений.Записывать = Истина;
	Для Каждого ТекСтрокаСписокПосещения Из СписокПосещения Цикл
		Движение = Движения.КоличествоПосещений.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ПериодРегистрации;
		Движение.Студент = ТекСтрокаСписокПосещения.Студент;
		Движение.КолНеуваж = ТекСтрокаСписокПосещения.КолНеуваж;
		Движение.КолУваж = ТекСтрокаСписокПосещения.КолУваж;
		Движение.КолБолел = ТекСтрокаСписокПосещения.КолБолел;
		Движение.КолОпоздал = ТекСтрокаСписокПосещения.КолОпоздал;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
